In [83]:
import pandas as pd
import numpy as np
from io import StringIO
employees="""id,name,age,salary,department,join_date
1,Alice,25,50000,HR,2021-01-15
2,Bob,,60000,Engineering,2020-06-20
3,Charlie,35,,Engineering,2019-03-10
4,David,29,55000,,2022-08-01
5,Eva,NaN,48000,HR,
6,,40,70000,Finance,2018-11-30
7,Frank,28,52000,Engineering,2021-09-12
8,Grace,,58000,HR,2020-02-18
9,Hannah,31,,Marketing,2019-07-25
10,Ian,45,80000,Finance,
11,Jack,27,48000,,2021-11-05
12,Karen,34,62000,Engineering,2018-04-14
13,Liam,NaN,54000,HR,2022-01-09
14,Mia,26,,Marketing,2020-05-21
15,Noah,38,72000,Finance,2017-10-30
16,Olivia,,51000,HR,2021-03-17
17,Paul,41,69000,,2016-08-19
18,Quinn,33,,Engineering,2019-12-01
19,Rachel,29,56000,Marketing,2022-06-11
20,Steve,NaN,75000,Finance,
21,Tina,24,47000,HR,2021-07-07
22,Uma,36,,Engineering,2018-09-23
23,Victor,39,68000,,2017-02-14
24,Wendy,,59000,Marketing,2020-10-05
25,Xavier,42,81000,Finance,2016-11-11
26,Yara,27,,HR,2022-04-03
27,Zack,31,61000,Engineering,
28,Anna,35,64000,Marketing,2019-06-06
29,Brian,NaN,58000,HR,2020-01-01
30,Cathy,28,,Engineering,2021-08-15
31,Derek,44,77000,Finance,2015-12-20
32,Elena,,53000,Marketing,2020-03-08
33,Felix,37,,Engineering,2018-07-27
34,Gina,26,49000,HR,2022-09-01
35,Harry,40,71000,,2017-05-13
36,Irene,32,,Marketing,
37,Jason,29,56000,Engineering,2021-04-22
38,Kelly,NaN,52000,HR,2019-11-09
39,Leo,34,,Finance,2018-01-30
40,Mona,25,47000,,2022-02-14
41,Nate,,66000,Engineering,2020-06-06
42,Opal,38,,HR,2017-09-19
43,Peter,45,82000,Finance,2016-04-25
44,Queen,27,50000,Marketing,
45,Ron,36,,Engineering,2019-08-18
46,Sara,31,59000,,2021-12-01
47,Tom,NaN,61000,Engineering,2020-10-10
48,Ursula,28,,HR,2022-05-05
49,Vincent,41,76000,Finance,
50,Willow,33,63000,Marketing,2018-06-16
51,Xena,,54000,HR,2019-03-03
52,Yusuf,39,,Engineering,2017-07-07
53,Zara,24,46000,,2022-11-11
54,Adam,35,65000,Finance,2016-02-02
55,Bella,29,,Marketing,2020-09-09
56,Carl,NaN,70000,Engineering,
57,Daisy,26,48000,HR,2021-01-01
58,Ethan,,72000,Finance,2018-08-08
59,Fiona,34,,Marketing,2019-04-04
60,George,43,79000,,2015-05-05"""


df=pd.read_csv(StringIO(employees))
df.to_csv("employees.csv",index=False)
df

    id     name   age   salary   department   join_date
0    1    Alice  25.0  50000.0           HR  2021-01-15
1    2      Bob   NaN  60000.0  Engineering  2020-06-20
2    3  Charlie  35.0      NaN  Engineering  2019-03-10
3    4    David  29.0  55000.0          NaN  2022-08-01
4    5      Eva   NaN  48000.0           HR         NaN
5    6      NaN  40.0  70000.0      Finance  2018-11-30
6    7    Frank  28.0  52000.0  Engineering  2021-09-12
7    8    Grace   NaN  58000.0           HR  2020-02-18
8    9   Hannah  31.0      NaN    Marketing  2019-07-25
9   10      Ian  45.0  80000.0      Finance         NaN
10  11     Jack  27.0  48000.0          NaN  2021-11-05
11  12    Karen  34.0  62000.0  Engineering  2018-04-14
12  13     Liam   NaN  54000.0           HR  2022-01-09
13  14      Mia  26.0      NaN    Marketing  2020-05-21
14  15     Noah  38.0  72000.0      Finance  2017-10-30
15  16   Olivia   NaN  51000.0           HR  2021-03-17
16  17     Paul  41.0  69000.0          NaN  2016-08-19
17  18    Quinn  33.0      NaN  Engineering  2019-12-01
18  19   Rachel  29.0  56000.0    Marketing  2022-06-11
19  20    Steve   NaN  75000.0      Finance         NaN
20  21     Tina  24.0  47000.0           HR  2021-07-07
21  22      Uma  36.0      NaN  Engineering  2018-09-23
22  23   Victor  39.0  68000.0          NaN  2017-02-14
23  24    Wendy   NaN  59000.0    Marketing  2020-10-05
24  25   Xavier  42.0  81000.0      Finance  2016-11-11
25  26     Yara  27.0      NaN           HR  2022-04-03
26  27     Zack  31.0  61000.0  Engineering         NaN
27  28     Anna  35.0  64000.0    Marketing  2019-06-06
28  29    Brian   NaN  58000.0           HR  2020-01-01
29  30    Cathy  28.0      NaN  Engineering  2021-08-15
30  31    Derek  44.0  77000.0      Finance  2015-12-20
31  32    Elena   NaN  53000.0    Marketing  2020-03-08
32  33    Felix  37.0      NaN  Engineering  2018-07-27
33  34     Gina  26.0  49000.0           HR  2022-09-01
34  35    Harry  40.0  71000.0          NaN  2017-05-13
35  36    Irene  32.0      NaN    Marketing         NaN
36  37    Jason  29.0  56000.0  Engineering  2021-04-22
37  38    Kelly   NaN  52000.0           HR  2019-11-09
38  39      Leo  34.0      NaN      Finance  2018-01-30
39  40     Mona  25.0  47000.0          NaN  2022-02-14
40  41     Nate   NaN  66000.0  Engineering  2020-06-06
41  42     Opal  38.0      NaN           HR  2017-09-19
42  43    Peter  45.0  82000.0      Finance  2016-04-25
43  44    Queen  27.0  50000.0    Marketing         NaN
44  45      Ron  36.0      NaN  Engineering  2019-08-18
45  46     Sara  31.0  59000.0          NaN  2021-12-01
46  47      Tom   NaN  61000.0  Engineering  2020-10-10
47  48   Ursula  28.0      NaN           HR  2022-05-05
48  49  Vincent  41.0  76000.0      Finance         NaN
49  50   Willow  33.0  63000.0    Marketing  2018-06-16
50  51     Xena   NaN  54000.0           HR  2019-03-03
51  52    Yusuf  39.0      NaN  Engineering  2017-07-07
52  53     Zara  24.0  46000.0          NaN  2022-11-11
53  54     Adam  35.0  65000.0      Finance  2016-02-02
54  55    Bella  29.0      NaN    Marketing  2020-09-09
55  56     Carl   NaN  70000.0  Engineering         NaN
56  57    Daisy  26.0  48000.0           HR  2021-01-01
57  58    Ethan   NaN  72000.0      Finance  2018-08-08
58  59    Fiona  34.0      NaN    Marketing  2019-04-04
59  60   George  43.0  79000.0          NaN  2015-05-05

In [84]:
df=df.dropna(subset=['name']).copy()
df

    id     name   age   salary   department   join_date
0    1    Alice  25.0  50000.0           HR  2021-01-15
1    2      Bob   NaN  60000.0  Engineering  2020-06-20
2    3  Charlie  35.0      NaN  Engineering  2019-03-10
3    4    David  29.0  55000.0          NaN  2022-08-01
4    5      Eva   NaN  48000.0           HR         NaN
6    7    Frank  28.0  52000.0  Engineering  2021-09-12
7    8    Grace   NaN  58000.0           HR  2020-02-18
8    9   Hannah  31.0      NaN    Marketing  2019-07-25
9   10      Ian  45.0  80000.0      Finance         NaN
10  11     Jack  27.0  48000.0          NaN  2021-11-05
11  12    Karen  34.0  62000.0  Engineering  2018-04-14
12  13     Liam   NaN  54000.0           HR  2022-01-09
13  14      Mia  26.0      NaN    Marketing  2020-05-21
14  15     Noah  38.0  72000.0      Finance  2017-10-30
15  16   Olivia   NaN  51000.0           HR  2021-03-17
16  17     Paul  41.0  69000.0          NaN  2016-08-19
17  18    Quinn  33.0      NaN  Engineering  2019-12-01
18  19   Rachel  29.0  56000.0    Marketing  2022-06-11
19  20    Steve   NaN  75000.0      Finance         NaN
20  21     Tina  24.0  47000.0           HR  2021-07-07
21  22      Uma  36.0      NaN  Engineering  2018-09-23
22  23   Victor  39.0  68000.0          NaN  2017-02-14
23  24    Wendy   NaN  59000.0    Marketing  2020-10-05
24  25   Xavier  42.0  81000.0      Finance  2016-11-11
25  26     Yara  27.0      NaN           HR  2022-04-03
26  27     Zack  31.0  61000.0  Engineering         NaN
27  28     Anna  35.0  64000.0    Marketing  2019-06-06
28  29    Brian   NaN  58000.0           HR  2020-01-01
29  30    Cathy  28.0      NaN  Engineering  2021-08-15
30  31    Derek  44.0  77000.0      Finance  2015-12-20
31  32    Elena   NaN  53000.0    Marketing  2020-03-08
32  33    Felix  37.0      NaN  Engineering  2018-07-27
33  34     Gina  26.0  49000.0           HR  2022-09-01
34  35    Harry  40.0  71000.0          NaN  2017-05-13
35  36    Irene  32.0      NaN    Marketing         NaN
36  37    Jason  29.0  56000.0  Engineering  2021-04-22
37  38    Kelly   NaN  52000.0           HR  2019-11-09
38  39      Leo  34.0      NaN      Finance  2018-01-30
39  40     Mona  25.0  47000.0          NaN  2022-02-14
40  41     Nate   NaN  66000.0  Engineering  2020-06-06
41  42     Opal  38.0      NaN           HR  2017-09-19
42  43    Peter  45.0  82000.0      Finance  2016-04-25
43  44    Queen  27.0  50000.0    Marketing         NaN
44  45      Ron  36.0      NaN  Engineering  2019-08-18
45  46     Sara  31.0  59000.0          NaN  2021-12-01
46  47      Tom   NaN  61000.0  Engineering  2020-10-10
47  48   Ursula  28.0      NaN           HR  2022-05-05
48  49  Vincent  41.0  76000.0      Finance         NaN
49  50   Willow  33.0  63000.0    Marketing  2018-06-16
50  51     Xena   NaN  54000.0           HR  2019-03-03
51  52    Yusuf  39.0      NaN  Engineering  2017-07-07
52  53     Zara  24.0  46000.0          NaN  2022-11-11
53  54     Adam  35.0  65000.0      Finance  2016-02-02
54  55    Bella  29.0      NaN    Marketing  2020-09-09
55  56     Carl   NaN  70000.0  Engineering         NaN
56  57    Daisy  26.0  48000.0           HR  2021-01-01
57  58    Ethan   NaN  72000.0      Finance  2018-08-08
58  59    Fiona  34.0      NaN    Marketing  2019-04-04
59  60   George  43.0  79000.0          NaN  2015-05-05

In [85]:
mean_age=df['age'].mean()
mean_age

np.float64(33.15909090909091)

In [86]:
df['age']=df['age'].fillna(mean_age)
df

    id     name        age   salary   department   join_date
0    1    Alice  25.000000  50000.0           HR  2021-01-15
1    2      Bob  33.159091  60000.0  Engineering  2020-06-20
2    3  Charlie  35.000000      NaN  Engineering  2019-03-10
3    4    David  29.000000  55000.0          NaN  2022-08-01
4    5      Eva  33.159091  48000.0           HR         NaN
6    7    Frank  28.000000  52000.0  Engineering  2021-09-12
7    8    Grace  33.159091  58000.0           HR  2020-02-18
8    9   Hannah  31.000000      NaN    Marketing  2019-07-25
9   10      Ian  45.000000  80000.0      Finance         NaN
10  11     Jack  27.000000  48000.0          NaN  2021-11-05
11  12    Karen  34.000000  62000.0  Engineering  2018-04-14
12  13     Liam  33.159091  54000.0           HR  2022-01-09
13  14      Mia  26.000000      NaN    Marketing  2020-05-21
14  15     Noah  38.000000  72000.0      Finance  2017-10-30
15  16   Olivia  33.159091  51000.0           HR  2021-03-17
16  17     Paul  41.000000  69000.0          NaN  2016-08-19
17  18    Quinn  33.000000      NaN  Engineering  2019-12-01
18  19   Rachel  29.000000  56000.0    Marketing  2022-06-11
19  20    Steve  33.159091  75000.0      Finance         NaN
20  21     Tina  24.000000  47000.0           HR  2021-07-07
21  22      Uma  36.000000      NaN  Engineering  2018-09-23
22  23   Victor  39.000000  68000.0          NaN  2017-02-14
23  24    Wendy  33.159091  59000.0    Marketing  2020-10-05
24  25   Xavier  42.000000  81000.0      Finance  2016-11-11
25  26     Yara  27.000000      NaN           HR  2022-04-03
26  27     Zack  31.000000  61000.0  Engineering         NaN
27  28     Anna  35.000000  64000.0    Marketing  2019-06-06
28  29    Brian  33.159091  58000.0           HR  2020-01-01
29  30    Cathy  28.000000      NaN  Engineering  2021-08-15
30  31    Derek  44.000000  77000.0      Finance  2015-12-20
31  32    Elena  33.159091  53000.0    Marketing  2020-03-08
32  33    Felix  37.000000      NaN  Engineering  2018-07-27
33  34     Gina  26.000000  49000.0           HR  2022-09-01
34  35    Harry  40.000000  71000.0          NaN  2017-05-13
35  36    Irene  32.000000      NaN    Marketing         NaN
36  37    Jason  29.000000  56000.0  Engineering  2021-04-22
37  38    Kelly  33.159091  52000.0           HR  2019-11-09
38  39      Leo  34.000000      NaN      Finance  2018-01-30
39  40     Mona  25.000000  47000.0          NaN  2022-02-14
40  41     Nate  33.159091  66000.0  Engineering  2020-06-06
41  42     Opal  38.000000      NaN           HR  2017-09-19
42  43    Peter  45.000000  82000.0      Finance  2016-04-25
43  44    Queen  27.000000  50000.0    Marketing         NaN
44  45      Ron  36.000000      NaN  Engineering  2019-08-18
45  46     Sara  31.000000  59000.0          NaN  2021-12-01
46  47      Tom  33.159091  61000.0  Engineering  2020-10-10
47  48   Ursula  28.000000      NaN           HR  2022-05-05
48  49  Vincent  41.000000  76000.0      Finance         NaN
49  50   Willow  33.000000  63000.0    Marketing  2018-06-16
50  51     Xena  33.159091  54000.0           HR  2019-03-03
51  52    Yusuf  39.000000      NaN  Engineering  2017-07-07
52  53     Zara  24.000000  46000.0          NaN  2022-11-11
53  54     Adam  35.000000  65000.0      Finance  2016-02-02
54  55    Bella  29.000000      NaN    Marketing  2020-09-09
55  56     Carl  33.159091  70000.0  Engineering         NaN
56  57    Daisy  26.000000  48000.0           HR  2021-01-01
57  58    Ethan  33.159091  72000.0      Finance  2018-08-08
58  59    Fiona  34.000000      NaN    Marketing  2019-04-04
59  60   George  43.000000  79000.0          NaN  2015-05-05

In [87]:
median_salary=df['salary'].median()
median_salary

np.float64(59000.0)

In [88]:
df['salary']=df['salary'].fillna(median_salary)
df

    id     name        age   salary   department   join_date
0    1    Alice  25.000000  50000.0           HR  2021-01-15
1    2      Bob  33.159091  60000.0  Engineering  2020-06-20
2    3  Charlie  35.000000  59000.0  Engineering  2019-03-10
3    4    David  29.000000  55000.0          NaN  2022-08-01
4    5      Eva  33.159091  48000.0           HR         NaN
6    7    Frank  28.000000  52000.0  Engineering  2021-09-12
7    8    Grace  33.159091  58000.0           HR  2020-02-18
8    9   Hannah  31.000000  59000.0    Marketing  2019-07-25
9   10      Ian  45.000000  80000.0      Finance         NaN
10  11     Jack  27.000000  48000.0          NaN  2021-11-05
11  12    Karen  34.000000  62000.0  Engineering  2018-04-14
12  13     Liam  33.159091  54000.0           HR  2022-01-09
13  14      Mia  26.000000  59000.0    Marketing  2020-05-21
14  15     Noah  38.000000  72000.0      Finance  2017-10-30
15  16   Olivia  33.159091  51000.0           HR  2021-03-17
16  17     Paul  41.000000  69000.0          NaN  2016-08-19
17  18    Quinn  33.000000  59000.0  Engineering  2019-12-01
18  19   Rachel  29.000000  56000.0    Marketing  2022-06-11
19  20    Steve  33.159091  75000.0      Finance         NaN
20  21     Tina  24.000000  47000.0           HR  2021-07-07
21  22      Uma  36.000000  59000.0  Engineering  2018-09-23
22  23   Victor  39.000000  68000.0          NaN  2017-02-14
23  24    Wendy  33.159091  59000.0    Marketing  2020-10-05
24  25   Xavier  42.000000  81000.0      Finance  2016-11-11
25  26     Yara  27.000000  59000.0           HR  2022-04-03
26  27     Zack  31.000000  61000.0  Engineering         NaN
27  28     Anna  35.000000  64000.0    Marketing  2019-06-06
28  29    Brian  33.159091  58000.0           HR  2020-01-01
29  30    Cathy  28.000000  59000.0  Engineering  2021-08-15
30  31    Derek  44.000000  77000.0      Finance  2015-12-20
31  32    Elena  33.159091  53000.0    Marketing  2020-03-08
32  33    Felix  37.000000  59000.0  Engineering  2018-07-27
33  34     Gina  26.000000  49000.0           HR  2022-09-01
34  35    Harry  40.000000  71000.0          NaN  2017-05-13
35  36    Irene  32.000000  59000.0    Marketing         NaN
36  37    Jason  29.000000  56000.0  Engineering  2021-04-22
37  38    Kelly  33.159091  52000.0           HR  2019-11-09
38  39      Leo  34.000000  59000.0      Finance  2018-01-30
39  40     Mona  25.000000  47000.0          NaN  2022-02-14
40  41     Nate  33.159091  66000.0  Engineering  2020-06-06
41  42     Opal  38.000000  59000.0           HR  2017-09-19
42  43    Peter  45.000000  82000.0      Finance  2016-04-25
43  44    Queen  27.000000  50000.0    Marketing         NaN
44  45      Ron  36.000000  59000.0  Engineering  2019-08-18
45  46     Sara  31.000000  59000.0          NaN  2021-12-01
46  47      Tom  33.159091  61000.0  Engineering  2020-10-10
47  48   Ursula  28.000000  59000.0           HR  2022-05-05
48  49  Vincent  41.000000  76000.0      Finance         NaN
49  50   Willow  33.000000  63000.0    Marketing  2018-06-16
50  51     Xena  33.159091  54000.0           HR  2019-03-03
51  52    Yusuf  39.000000  59000.0  Engineering  2017-07-07
52  53     Zara  24.000000  46000.0          NaN  2022-11-11
53  54     Adam  35.000000  65000.0      Finance  2016-02-02
54  55    Bella  29.000000  59000.0    Marketing  2020-09-09
55  56     Carl  33.159091  70000.0  Engineering         NaN
56  57    Daisy  26.000000  48000.0           HR  2021-01-01
57  58    Ethan  33.159091  72000.0      Finance  2018-08-08
58  59    Fiona  34.000000  59000.0    Marketing  2019-04-04
59  60   George  43.000000  79000.0          NaN  2015-05-05

In [89]:
df['department']=df['department'].fillna('Unknown')
df.head()

   id     name        age   salary   department   join_date
0   1    Alice  25.000000  50000.0           HR  2021-01-15
1   2      Bob  33.159091  60000.0  Engineering  2020-06-20
2   3  Charlie  35.000000  59000.0  Engineering  2019-03-10
3   4    David  29.000000  55000.0      Unknown  2022-08-01
4   5      Eva  33.159091  48000.0           HR         NaN

In [90]:
df['join_date']=pd.to_datetime(df['join_date'],errors='coerce')
df.head()

   id     name        age   salary   department  join_date
0   1    Alice  25.000000  50000.0           HR 2021-01-15
1   2      Bob  33.159091  60000.0  Engineering 2020-06-20
2   3  Charlie  35.000000  59000.0  Engineering 2019-03-10
3   4    David  29.000000  55000.0      Unknown 2022-08-01
4   5      Eva  33.159091  48000.0           HR        NaT

In [91]:
df=df.dropna(subset='join_date')
df.head()

   id     name        age   salary   department  join_date
0   1    Alice  25.000000  50000.0           HR 2021-01-15
1   2      Bob  33.159091  60000.0  Engineering 2020-06-20
2   3  Charlie  35.000000  59000.0  Engineering 2019-03-10
3   4    David  29.000000  55000.0      Unknown 2022-08-01
6   7    Frank  28.000000  52000.0  Engineering 2021-09-12

In [92]:
df['join_date'].isnull().sum()

np.int64(0)

In [93]:
df.reset_index(drop=True)

    id     name        age   salary   department  join_date
0    1    Alice  25.000000  50000.0           HR 2021-01-15
1    2      Bob  33.159091  60000.0  Engineering 2020-06-20
2    3  Charlie  35.000000  59000.0  Engineering 2019-03-10
3    4    David  29.000000  55000.0      Unknown 2022-08-01
4    7    Frank  28.000000  52000.0  Engineering 2021-09-12
5    8    Grace  33.159091  58000.0           HR 2020-02-18
6    9   Hannah  31.000000  59000.0    Marketing 2019-07-25
7   11     Jack  27.000000  48000.0      Unknown 2021-11-05
8   12    Karen  34.000000  62000.0  Engineering 2018-04-14
9   13     Liam  33.159091  54000.0           HR 2022-01-09
10  14      Mia  26.000000  59000.0    Marketing 2020-05-21
11  15     Noah  38.000000  72000.0      Finance 2017-10-30
12  16   Olivia  33.159091  51000.0           HR 2021-03-17
13  17     Paul  41.000000  69000.0      Unknown 2016-08-19
14  18    Quinn  33.000000  59000.0  Engineering 2019-12-01
15  19   Rachel  29.000000  56000.0    Marketing 2022-06-11
16  21     Tina  24.000000  47000.0           HR 2021-07-07
17  22      Uma  36.000000  59000.0  Engineering 2018-09-23
18  23   Victor  39.000000  68000.0      Unknown 2017-02-14
19  24    Wendy  33.159091  59000.0    Marketing 2020-10-05
20  25   Xavier  42.000000  81000.0      Finance 2016-11-11
21  26     Yara  27.000000  59000.0           HR 2022-04-03
22  28     Anna  35.000000  64000.0    Marketing 2019-06-06
23  29    Brian  33.159091  58000.0           HR 2020-01-01
24  30    Cathy  28.000000  59000.0  Engineering 2021-08-15
25  31    Derek  44.000000  77000.0      Finance 2015-12-20
26  32    Elena  33.159091  53000.0    Marketing 2020-03-08
27  33    Felix  37.000000  59000.0  Engineering 2018-07-27
28  34     Gina  26.000000  49000.0           HR 2022-09-01
29  35    Harry  40.000000  71000.0      Unknown 2017-05-13
30  37    Jason  29.000000  56000.0  Engineering 2021-04-22
31  38    Kelly  33.159091  52000.0           HR 2019-11-09
32  39      Leo  34.000000  59000.0      Finance 2018-01-30
33  40     Mona  25.000000  47000.0      Unknown 2022-02-14
34  41     Nate  33.159091  66000.0  Engineering 2020-06-06
35  42     Opal  38.000000  59000.0           HR 2017-09-19
36  43    Peter  45.000000  82000.0      Finance 2016-04-25
37  45      Ron  36.000000  59000.0  Engineering 2019-08-18
38  46     Sara  31.000000  59000.0      Unknown 2021-12-01
39  47      Tom  33.159091  61000.0  Engineering 2020-10-10
40  48   Ursula  28.000000  59000.0           HR 2022-05-05
41  50   Willow  33.000000  63000.0    Marketing 2018-06-16
42  51     Xena  33.159091  54000.0           HR 2019-03-03
43  52    Yusuf  39.000000  59000.0  Engineering 2017-07-07
44  53     Zara  24.000000  46000.0      Unknown 2022-11-11
45  54     Adam  35.000000  65000.0      Finance 2016-02-02
46  55    Bella  29.000000  59000.0    Marketing 2020-09-09
47  57    Daisy  26.000000  48000.0           HR 2021-01-01
48  58    Ethan  33.159091  72000.0      Finance 2018-08-08
49  59    Fiona  34.000000  59000.0    Marketing 2019-04-04
50  60   George  43.000000  79000.0      Unknown 2015-05-05

In [94]:
df.fillna(method='ffill')

C:\Users\user name\AppData\Local\Temp\ipykernel_1196\253117906.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

    id     name        age   salary   department  join_date
0    1    Alice  25.000000  50000.0           HR 2021-01-15
1    2      Bob  33.159091  60000.0  Engineering 2020-06-20
2    3  Charlie  35.000000  59000.0  Engineering 2019-03-10
3    4    David  29.000000  55000.0      Unknown 2022-08-01
6    7    Frank  28.000000  52000.0  Engineering 2021-09-12
7    8    Grace  33.159091  58000.0           HR 2020-02-18
8    9   Hannah  31.000000  59000.0    Marketing 2019-07-25
10  11     Jack  27.000000  48000.0      Unknown 2021-11-05
11  12    Karen  34.000000  62000.0  Engineering 2018-04-14
12  13     Liam  33.159091  54000.0           HR 2022-01-09
13  14      Mia  26.000000  59000.0    Marketing 2020-05-21
14  15     Noah  38.000000  72000.0      Finance 2017-10-30
15  16   Olivia  33.159091  51000.0           HR 2021-03-17
16  17     Paul  41.000000  69000.0      Unknown 2016-08-19
17  18    Quinn  33.000000  59000.0  Engineering 2019-12-01
18  19   Rachel  29.000000  56000.0    Marketing 2022-06-11
20  21     Tina  24.000000  47000.0           HR 2021-07-07
21  22      Uma  36.000000  59000.0  Engineering 2018-09-23
22  23   Victor  39.000000  68000.0      Unknown 2017-02-14
23  24    Wendy  33.159091  59000.0    Marketing 2020-10-05
24  25   Xavier  42.000000  81000.0      Finance 2016-11-11
25  26     Yara  27.000000  59000.0           HR 2022-04-03
27  28     Anna  35.000000  64000.0    Marketing 2019-06-06
28  29    Brian  33.159091  58000.0           HR 2020-01-01
29  30    Cathy  28.000000  59000.0  Engineering 2021-08-15
30  31    Derek  44.000000  77000.0      Finance 2015-12-20
31  32    Elena  33.159091  53000.0    Marketing 2020-03-08
32  33    Felix  37.000000  59000.0  Engineering 2018-07-27
33  34     Gina  26.000000  49000.0           HR 2022-09-01
34  35    Harry  40.000000  71000.0      Unknown 2017-05-13
36  37    Jason  29.000000  56000.0  Engineering 2021-04-22
37  38    Kelly  33.159091  52000.0           HR 2019-11-09
38  39      Leo  34.000000  59000.0      Finance 2018-01-30
39  40     Mona  25.000000  47000.0      Unknown 2022-02-14
40  41     Nate  33.159091  66000.0  Engineering 2020-06-06
41  42     Opal  38.000000  59000.0           HR 2017-09-19
42  43    Peter  45.000000  82000.0      Finance 2016-04-25
44  45      Ron  36.000000  59000.0  Engineering 2019-08-18
45  46     Sara  31.000000  59000.0      Unknown 2021-12-01
46  47      Tom  33.159091  61000.0  Engineering 2020-10-10
47  48   Ursula  28.000000  59000.0           HR 2022-05-05
49  50   Willow  33.000000  63000.0    Marketing 2018-06-16
50  51     Xena  33.159091  54000.0           HR 2019-03-03
51  52    Yusuf  39.000000  59000.0  Engineering 2017-07-07
52  53     Zara  24.000000  46000.0      Unknown 2022-11-11
53  54     Adam  35.000000  65000.0      Finance 2016-02-02
54  55    Bella  29.000000  59000.0    Marketing 2020-09-09
56  57    Daisy  26.000000  48000.0           HR 2021-01-01
57  58    Ethan  33.159091  72000.0      Finance 2018-08-08
58  59    Fiona  34.000000  59000.0    Marketing 2019-04-04
59  60   George  43.000000  79000.0      Unknown 2015-05-05

In [95]:
df.fillna(method='ffill', inplace=True)
df.head()

C:\Users\user name\AppData\Local\Temp\ipykernel_1196\2766238617.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', inplace=True)
C:\Users\user name\AppData\Local\Temp\ipykernel_1196\2766238617.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.fillna(method='ffill', inplace=True)

   id     name        age   salary   department  join_date
0   1    Alice  25.000000  50000.0           HR 2021-01-15
1   2      Bob  33.159091  60000.0  Engineering 2020-06-20
2   3  Charlie  35.000000  59000.0  Engineering 2019-03-10
3   4    David  29.000000  55000.0      Unknown 2022-08-01
6   7    Frank  28.000000  52000.0  Engineering 2021-09-12

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 51 entries, 0 to 59
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          51 non-null     int64
 1   name        51 non-null     object
 2   age         51 non-null     float64
 3   salary      51 non-null     float64
 4   department  51 non-null     object
 5   join_date   51 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(2)
memory usage: 2.8+ KB

In [97]:
df['age']=df['age'].astype(int)

C:\Users\user name\AppData\Local\Temp\ipykernel_1196\1889264292.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['age']=df['age'].astype(int)

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 51 entries, 0 to 59
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          51 non-null     int64
 1   name        51 non-null     object
 2   age         51 non-null     int64
 3   salary      51 non-null     float64
 4   department  51 non-null     object
 5   join_date   51 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 2.8+ KB

In [99]:
df['salary']=df['salary'].astype(int)

C:\Users\user name\AppData\Local\Temp\ipykernel_1196\461322919.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['salary']=df['salary'].astype(int)

In [100]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 51 entries, 0 to 59
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          51 non-null     int64
 1   name        51 non-null     object
 2   age         51 non-null     int64
 3   salary      51 non-null     int64
 4   department  51 non-null     object
 5   join_date   51 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 2.8+ KB

In [101]:
df.head()

   id     name  age  salary   department  join_date
0   1    Alice   25   50000           HR 2021-01-15
1   2      Bob   33   60000  Engineering 2020-06-20
2   3  Charlie   35   59000  Engineering 2019-03-10
3   4    David   29   55000      Unknown 2022-08-01
6   7    Frank   28   52000  Engineering 2021-09-12

In [102]:
df['bonus']=df['salary']* 0.01
df.head()

C:\Users\user name\AppData\Local\Temp\ipykernel_1196\3873808105.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['bonus']=df['salary']* 0.01

   id     name  age  salary   department  join_date  bonus
0   1    Alice   25   50000           HR 2021-01-15  500.0
1   2      Bob   33   60000  Engineering 2020-06-20  600.0
2   3  Charlie   35   59000  Engineering 2019-03-10  590.0
3   4    David   29   55000      Unknown 2022-08-01  550.0
6   7    Frank   28   52000  Engineering 2021-09-12  520.0

In [103]:
df['bonus']=df['bonus'].astype(int)
df.head()

C:\Users\user name\AppData\Local\Temp\ipykernel_1196\3215074462.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['bonus']=df['bonus'].astype(int)

   id     name  age  salary   department  join_date  bonus
0   1    Alice   25   50000           HR 2021-01-15    500
1   2      Bob   33   60000  Engineering 2020-06-20    600
2   3  Charlie   35   59000  Engineering 2019-03-10    590
3   4    David   29   55000      Unknown 2022-08-01    550
6   7    Frank   28   52000  Engineering 2021-09-12    520

In [104]:
df['performance_score']=np.random.randint(1,6,size=len(df))
df.head()

C:\Users\user name\AppData\Local\Temp\ipykernel_1196\1847430066.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['performance_score']=np.random.randint(1,6,size=len(df))

   id     name  age  salary   department  join_date  bonus  performance_score
0   1    Alice   25   50000           HR 2021-01-15    500                  2
1   2      Bob   33   60000  Engineering 2020-06-20    600                  5
2   3  Charlie   35   59000  Engineering 2019-03-10    590                  2
3   4    David   29   55000      Unknown 2022-08-01    550                  3
6   7    Frank   28   52000  Engineering 2021-09-12    520                  5

In [105]:
df.reset_index(drop=True)

    id     name  age  salary   department  join_date  bonus  performance_score
0    1    Alice   25   50000           HR 2021-01-15    500                  2
1    2      Bob   33   60000  Engineering 2020-06-20    600                  5
2    3  Charlie   35   59000  Engineering 2019-03-10    590                  2
3    4    David   29   55000      Unknown 2022-08-01    550                  3
4    7    Frank   28   52000  Engineering 2021-09-12    520                  5
5    8    Grace   33   58000           HR 2020-02-18    580                  3
6    9   Hannah   31   59000    Marketing 2019-07-25    590                  5
7   11     Jack   27   48000      Unknown 2021-11-05    480                  4
8   12    Karen   34   62000  Engineering 2018-04-14    620                  1
9   13     Liam   33   54000           HR 2022-01-09    540                  3
10  14      Mia   26   59000    Marketing 2020-05-21    590                  1
11  15     Noah   38   72000      Finance 2017-10-30    720                  1
12  16   Olivia   33   51000           HR 2021-03-17    510                  4
13  17     Paul   41   69000      Unknown 2016-08-19    690                  4
14  18    Quinn   33   59000  Engineering 2019-12-01    590                  3
15  19   Rachel   29   56000    Marketing 2022-06-11    560                  5
16  21     Tina   24   47000           HR 2021-07-07    470                  5
17  22      Uma   36   59000  Engineering 2018-09-23    590                  4
18  23   Victor   39   68000      Unknown 2017-02-14    680                  1
19  24    Wendy   33   59000    Marketing 2020-10-05    590                  2
20  25   Xavier   42   81000      Finance 2016-11-11    810                  5
21  26     Yara   27   59000           HR 2022-04-03    590                  5
22  28     Anna   35   64000    Marketing 2019-06-06    640                  4
23  29    Brian   33   58000           HR 2020-01-01    580                  1
24  30    Cathy   28   59000  Engineering 2021-08-15    590                  2
25  31    Derek   44   77000      Finance 2015-12-20    770                  3
26  32    Elena   33   53000    Marketing 2020-03-08    530                  5
27  33    Felix   37   59000  Engineering 2018-07-27    590                  1
28  34     Gina   26   49000           HR 2022-09-01    490                  2
29  35    Harry   40   71000      Unknown 2017-05-13    710                  4
30  37    Jason   29   56000  Engineering 2021-04-22    560                  1
31  38    Kelly   33   52000           HR 2019-11-09    520                  4
32  39      Leo   34   59000      Finance 2018-01-30    590                  3
33  40     Mona   25   47000      Unknown 2022-02-14    470                  2
34  41     Nate   33   66000  Engineering 2020-06-06    660                  4
35  42     Opal   38   59000           HR 2017-09-19    590                  2
36  43    Peter   45   82000      Finance 2016-04-25    820                  5
37  45      Ron   36   59000  Engineering 2019-08-18    590                  1
38  46     Sara   31   59000      Unknown 2021-12-01    590                  2
39  47      Tom   33   61000  Engineering 2020-10-10    610                  1
40  48   Ursula   28   59000           HR 2022-05-05    590                  5
41  50   Willow   33   63000    Marketing 2018-06-16    630                  5
42  51     Xena   33   54000           HR 2019-03-03    540                  1
43  52    Yusuf   39   59000  Engineering 2017-07-07    590                  2
44  53     Zara   24   46000      Unknown 2022-11-11    460                  3
45  54     Adam   35   65000      Finance 2016-02-02    650                  5
46  55    Bella   29   59000    Marketing 2020-09-09    590                  1
47  57    Daisy   26   48000           HR 2021-01-01    480                  1
48  58    Ethan   33   72000      Finance 2018-08-08    720                  5
49  59    Fiona   34   59000    Marketing 2019-04-04    590                  3
50  60   George   43   79000      Unknown 2015-05-05    790                  3

In [106]:
df=df.to_csv("employees_cleaned.csv")